RhinoInside.Revit API Documentation
GeometryEncoder.ToGeometryObject Method
 Converts the specified GeomertyBase object to an equivalent Revit GeometryObject.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8017
Syntax
public static GeometryObject ToGeometryObject(
	this GeometryBase value
)
Parameters
value
Type: GeometryBase
A value to convert.
Return Value
Type: GeometryObject
A Revit GeometryObject that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type GeometryBase. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace