RhinoInside.Revit API Documentation
GeometryEncoder.ToCurve Method (PolyCurve)
 Converts the specified PolyCurve to an equivalent Revit Curve.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8017
Syntax
public static Curve ToCurve(
	this PolyCurve value
)
Parameters
value
Type: PolyCurve
A value to convert.
Return Value
Type: Curve
A Revit Curve that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type PolyCurve. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryEncoder Class
ToCurve Overload
RhinoInside.Revit.Convert.Geometry Namespace