RhinoInside.Revit API Documentation
GeometryEncoder.ToCurveLoop Method
 Converts the specified Curve to an equivalent Revit CurveLoop.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8017
Syntax
public static CurveLoop ToCurveLoop(
	this Curve value
)
Parameters
value
Type: Curve
A value to convert.
Return Value
Type: CurveLoop
A Revit CurveLoop that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Curve. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace