RhinoInside.Revit API Documentation
GeometryEncoder.ToPolyLine Method
 Converts the specified Polyline to an equivalent Revit PolyLine.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8016
Syntax
public static PolyLine ToPolyLine(
	this Polyline value
)
Parameters
value
Type: Polyline
A value to convert.
Return Value
Type: PolyLine
A Revit PolyLine that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Polyline. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace