RhinoInside.Revit API Documentation
GeometryEncoder.ToSolid Method (Extrusion)
 Converts the specified Extrusion to an equivalent Revit Solid.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8017
Syntax
public static Solid ToSolid(
	this Extrusion value
)
Parameters
value
Type: Extrusion
A value to convert.
Return Value
Type: Solid
A Revit Solid that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Extrusion. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryEncoder Class
ToSolid Overload
RhinoInside.Revit.Convert.Geometry Namespace