RhinoInside.Revit API Documentation
GeometryEncoder.ToUV Method (Point2f)
 Converts the specified Point2f to an equivalent UV point.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8015
Syntax
public static UV ToUV(
	this Point2f value
)
Parameters
value
Type: Point2f
A value to convert.
Return Value
Type: UV
A Revit UV that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Point2f. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryEncoder Class
ToUV Overload
RhinoInside.Revit.Convert.Geometry Namespace