RhinoInside.Revit API Documentation
GeometryEncoder.ToBoundingBoxXYZ Method (Box)
 Converts the specified Box to an equivalent Revit BoundingBoxXYZ.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8015
Syntax
public static BoundingBoxXYZ ToBoundingBoxXYZ(
	this Box value
)
Parameters
value
Type: Box
A value to convert.
Return Value
Type: BoundingBoxXYZ
A Revit BoundingBoxXYZ that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Box. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryEncoder Class
ToBoundingBoxXYZ Overload
RhinoInside.Revit.Convert.Geometry Namespace