RhinoInside.Revit API Documentation
GeometryEncoder.ToCurve Method (NurbsCurve)
 Converts the specified NurbsCurve to an equivalent Revit Curve.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8016
Syntax
public static Curve ToCurve(
	this NurbsCurve value
)
Parameters
value
Type: NurbsCurve
A value to convert.
Return Value
Type: Curve
A Revit Curve that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type NurbsCurve. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryEncoder Class
ToCurve Overload
RhinoInside.Revit.Convert.Geometry Namespace