RhinoInside.Revit API Documentation
GeometryEncoder.ToArc Method (Circle)
 Converts the specified Circle to an equivalent closed Revit Arc.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8017
Syntax
public static Arc ToArc(
	this Circle value
)
Parameters
value
Type: Circle
A value to convert.
Return Value
Type: Arc
A Revit Arc that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Circle. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryEncoder Class
ToArc Overload
RhinoInside.Revit.Convert.Geometry Namespace