RhinoInside.Revit API Documentation
GeometryEncoder.ToMesh Method (Brep)
 Converts the specified Brep to an equivalent Revit Mesh.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8015
Syntax
public static Mesh ToMesh(
	this Brep value
)
Parameters
value
Type: Brep
A value to convert.
Return Value
Type: Mesh
A Revit Mesh that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Brep. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryEncoder Class
ToMesh Overload
RhinoInside.Revit.Convert.Geometry Namespace