RhinoInside.Revit API Documentation
GeometryEncoder.ToOutline Method
 Converts the specified BoundingBox to an equivalent Revit Outline.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8015
Syntax
public static Outline ToOutline(
	this BoundingBox value
)
Parameters
value
Type: BoundingBox
A value to convert.
Return Value
Type: Outline
A Revit Outline that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type BoundingBox. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace