RhinoInside.Revit API Documentation
GeometryEncoder.ToXYZ Method (Vector3f)
 Converts the specified Vector3f to an equivalent XYZ vector.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8016
Syntax
public static XYZ ToXYZ(
	this Vector3f value
)
Parameters
value
Type: Vector3f
A value to convert.
Return Value
Type: XYZ
A Revit XYZ that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Vector3f. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryEncoder Class
ToXYZ Overload
RhinoInside.Revit.Convert.Geometry Namespace