RhinoInside.Revit API Documentation
GeometryEncoder.ToPoints Method
 Converts the specified PointCloud to an equivalent Revit Point array.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8017
Syntax
public static Point[] ToPoints(
	this PointCloud value
)
Parameters
value
Type: PointCloud
A value to convert.
Return Value
Type: Point[]
A Revit Point array that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type PointCloud. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace