RhinoInside.Revit API Documentation
GeometryEncoder.ToPoint Method
 Converts the specified Point to an equivalent Revit Point.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8015
Syntax
public static Point ToPoint(
	this Point value
)
Parameters
value
Type: Point
A value to convert.
Return Value
Type: Point
A Revit Point that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Point. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace