RhinoInside.Revit API Documentation
GeometryEncoder.ToPlane Method
 Converts the specified Plane to an equivalent Revit Plane.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8015
Syntax
public static Plane ToPlane(
	this Plane value
)
Parameters
value
Type: Plane
A value to convert.
Return Value
Type: Plane
A Revit Plane that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Plane. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace